--[[
    ========== กำหนดสร้างร้านตลาดโลก Market ==========
]]
Config.Markets = {

    --------- ตัวอย่างการสร้างร้านตลาดโลก ---------
    {
        name  = "market_01",     -- กำหนดชื่ออ้างอิงตั้งอะไรก็ได้ (ภาษาอังกฤษเท่านั้น, ห้ามซ้ำกับร้านอื่นถ้ามีหลายร้าน) **ใช้แล้วห้ามเปลี่ยนชื่อ**
        --[[
            ==== หมวดหมู่ที่จะแสดงในร้าน ====
            ** อ้างอิงจากข้อมูล name จาก Config.Market_Categorys **
            ** หากไม่กำหนดจะแสดงทุกหมวดหมู่ที่สร้างไว้ **
        ]]
        categorys = {
            --"food", 
            --"weapon"
        },
        ----- Object NPC ที่ยืนอยู่ตรงจุดกดเปิดร้าน -----
        object = {
            -- หาข้อมูลชื่อ Model NPC ได้จาก https://wiki.rage.mp/index.php?title=Peds
            show    =  true,                           -- true = แสดง
            model   =  GetHashKey("s_m_y_barman_01"), -- Model
            type    =  "ped"
        },
        ----- DrawText ข้อความแสดงตรงจุดกดเปิดร้าน -----
        drawtext = {
            show     = true,               -- true = แสดง
            distance = 30.0,               -- อยู่ภายในระยะเท่าไหร่ถึงแสดง
            label    = "~g~World Market\n~w~ตลาดโลก",  -- ข้อความ
            size     = 1.3,                -- ขนาด
            z        = 2.4                 -- กำหนดให้สูงจากจุดเท่าไหร่
        },
        ----- Blip Map -----
        blip = {
            show    = true,            -- true = แสดง Blip ในแผนที่
            label   = "World Market",  -- ชื่อ Blip ในแผนที่
            sprite  = 207,             -- รูป
            colour  = 2,               -- สี
            scale   = 1.0,             -- ขนาด
        },
        ----- Marker -----
        marker = {
            show     = false,                          -- true = แสดง
            distance = 30.0,                           -- อยู่ภายในระยะเท่าไหร่ถึงแสดง
            type     = 1,                              -- ประเภท
            size     = { x = 1.5, y = 1.5, z = 1.0 },  -- ขนาด
            color    = { r = 0, g = 128, b = 255 },    -- สี
        },
        ----- กำหนดจุดที่สามารถกดเปิดร้านได้ -----
        press_distance = 2.0, -- กำหนดยะระห่างในการกดเปิดร้าน
        pos = {
            {x = -1277.28, y = -2989.17, z = 12.94, h = 248.68}
        },
        ------ ตั้งค่าไอเทม ------
        items_buy_require = {
            -- กำหนดไอเทมที่ต้องมีก่อนถึงจะสามารถซื้อไอเทมจากร้านได้
            -- "phone",
            --"bread",
        },
        items_sell_require = {
            -- กำหนดไอเทมที่ต้องมีก่อนถึงจะสามารถขายไอเทมลงในร้านได้
            --"phone",
            --"water"
        },
        ------ อาชีพ/หน่วยงาน ------
        job_buy_require = {
            -- กำหนดอาชีพ/หน่วยงาน เท่านั้นถึงจะซื้อไอเทมได้
            -- "police",
            --"ambulance",
            --"mechanic"
        },
        job_sell_require = {
            -- กำหนดอาชีพ/หน่วยงาน เท่านั้นถึงจะลงขายไอเทมได้
            --"police",
            --"ambulance",
            -- "mechanic"
        },
        ----- ตั้งค่าไอเทมที่จะไม่ให้ลงขาย -----
        items_sell_bl = {
            --"bread",
            --"water"
        },
        ------ ตั้งค่าไอเทมที่จะให้ลงขายได้เท่านั้น ------
        items_sell_only = {
            -- "bread",
            -- "water"
        },
        items_sell_limit_player     =   20,        -- จำกัดรายการไอเทมต่อผู้เล่น 1คน สามารถลงขายได้กี่อย่าง (-1 ไม่จำกัด)
        items_sell_limit_all        =   2000,      -- จำกัดรายการไอเทมทั้งหมดที่สามารถลงขายได้ *นับจากไอเทมทั้งหมดที่คนลงขาย* (-1 ไม่จำกัด)
        vat_before                  =   10,        -- กำหนดภาษีก่อนขาย (คิดเป็น % จากราคาไอเทมที่ขาย)
        vat_after                   =   0,         -- กำหนดภาษีหลังขายได้แล้ว (คิดเป็น % จากราคาไอเทมที่ขาย)
        price_money                 =   true,      -- false = ร้านนี้จะไม่สามารถลงขายไอเทมเป็นเงินเขียวได้
        price_black_money           =   true,      -- false = ร้านนี้จะไม่สามารถลงขายไอเทมเป็นเงินแดงได้
        buy_myitem                  =   true,      -- false = ไม่สามารถซื้อไอเทมที่ตัวเองลงขายได้
        items_sell_cancel           =   true,      -- false = ไม่สามารถยกเลิกคืนไอเทมที่ลงขายได้
        items_sell_cancel_delay     =   0          -- ดีเลย์ในการยกเลิกไอเทมที่ลงขาย (1 = 1นาที)
    },

    
}